test/performance tests/Mezzanine Test Plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.1.1 r1855137">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Mezzanine Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
          <stringProp name="HTTPSampler.port">8000</stringProp>
          <stringProp name="HTTPSampler.path">/test-page-title</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">/home/dibyadarshan/Desktop/Github Repos/mezzanine/test/Performance Tests/Mezzanine Test Plan.jmx</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="49586">200</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          <boolProp name="Assertion.assume_success">false</boolProp>
          <intProp name="Assertion.test_type">8</intProp>
        </ResponseAssertion>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>
1572847007212,70,HTTP Request,200,OK,Users 1-2,text,true,,4497,267,2,2,http://127.0.0.1:8000/test-page-title/,3,0,1
1572847007212,3,HTTP Request-0,301,Moved Permanently,Users 1-2,text,true,,197,133,2,2,http://127.0.0.1:8000/test-page-title,3,0,1
1572847007215,67,HTTP Request-1,200,OK,Users 1-2,text,true,,4300,134,2,2,http://127.0.0.1:8000/test-page-title/,67,0,1
1572847007171,98,HTTP Request,200,OK,Users 1-1,text,true,,4497,267,2,2,http://127.0.0.1:8000/test-page-title/,34,0,26
1572847007171,34,HTTP Request-0,301,Moved Permanently,Users 1-1,text,true,,197,133,2,2,http://127.0.0.1:8000/test-page-title,34,0,26
1572847007205,64,HTTP Request-1,200,OK,Users 1-1,text,true,,4300,134,2,2,http://127.0.0.1:8000/test-page-title/,64,0,1
1572847007310,88,HTTP Request,200,OK,Users 1-3,text,true,,4497,267,1,1,http://127.0.0.1:8000/test-page-title/,4,0,1
1572847007310,4,HTTP Request-0,301,Moved Permanently,Users 1-3,text,true,,197,133,1,1,http://127.0.0.1:8000/test-page-title,4,0,1
1572847007315,83,HTTP Request-1,200,OK,Users 1-3,text,true,,4300,134,1,1,http://127.0.0.1:8000/test-page-title/,83,0,0
1572847007410,31,HTTP Request,200,OK,Users 1-4,text,true,,4497,267,1,1,http://127.0.0.1:8000/test-page-title/,2,0,0
1572847007410,2,HTTP Request-0,301,Moved Permanently,Users 1-4,text,true,,197,133,1,1,http://127.0.0.1:8000/test-page-title,2,0,0
1572847007412,29,HTTP Request-1,200,OK,Users 1-4,text,true,,4300,134,1,1,http://127.0.0.1:8000/test-page-title/,29,0,0
1572847007516,139,HTTP Request,200,OK,Users 1-5,text,true,,4497,267,2,2,http://127.0.0.1:8000/test-page-title/,15,0,2
1572847007516,15,HTTP Request-0,301,Moved Permanently,Users 1-5,text,true,,197,133,2,2,http://127.0.0.1:8000/test-page-title,15,0,2
1572847007532,123,HTTP Request-1,200,OK,Users 1-5,text,true,,4300,134,2,2,http://127.0.0.1:8000/test-page-title/,123,0,2
1572847007612,63,HTTP Request,200,OK,Users 1-6,text,true,,4497,267,1,1,http://127.0.0.1:8000/test-page-title/,11,0,1
1572847007612,11,HTTP Request-0,301,Moved Permanently,Users 1-6,text,true,,197,133,1,1,http://127.0.0.1:8000/test-page-title,11,0,1
1572847007623,52,HTTP Request-1,200,OK,Users 1-6,text,true,,4300,134,1,1,http://127.0.0.1:8000/test-page-title/,52,0,0
1572847007705,29,HTTP Request,200,OK,Users 1-7,text,true,,4497,267,1,1,http://127.0.0.1:8000/test-page-title/,1,0,0
1572847007705,2,HTTP Request-0,301,Moved Permanently,Users 1-7,text,true,,197,133,1,1,http://127.0.0.1:8000/test-page-title,1,0,0
1572847007707,27,HTTP Request-1,200,OK,Users 1-7,text,true,,4300,134,1,1,http://127.0.0.1:8000/test-page-title/,26,0,0
1572847007805,116,HTTP Request,200,OK,Users 1-8,text,true,,4497,267,2,2,http://127.0.0.1:8000/test-page-title/,7,0,2
1572847007805,7,HTTP Request-0,301,Moved Permanently,Users 1-8,text,true,,197,133,2,2,http://127.0.0.1:8000/test-page-title,7,0,2
1572847007813,108,HTTP Request-1,200,OK,Users 1-8,text,true,,4300,134,2,2,http://127.0.0.1:8000/test-page-title/,108,0,1
1572847007903,46,HTTP Request,200,OK,Users 1-9,text,true,,4497,267,1,1,http://127.0.0.1:8000/test-page-title/,10,0,1
1572847007903,10,HTTP Request-0,301,Moved Permanently,Users 1-9,text,true,,197,133,1,1,http://127.0.0.1:8000/test-page-title,10,0,1
1572847007913,36,HTTP Request-1,200,OK,Users 1-9,text,true,,4300,134,1,1,http://127.0.0.1:8000/test-page-title/,36,0,1
1572847008002,39,HTTP Request,200,OK,Users 1-10,text,true,,4497,267,1,1,http://127.0.0.1:8000/test-page-title/,3,0,1
1572847008002,3,HTTP Request-0,301,Moved Permanently,Users 1-10,text,true,,197,133,1,1,http://127.0.0.1:8000/test-page-title,3,0,1
1572847008005,36,HTTP Request-1,200,OK,Users 1-10,text,true,,4300,134,1,1,http://127.0.0.1:8000/test-page-title/,36,0,0